In [8]:
import pandas as pd
import numpy as np

In [9]:
#create a pandas dataframe
data = {'col1': ['john', 'sally', 'dorthy', 'cindy', 'mark'],
        'col2': [1,2,5,7,0],
        'col3': [1,np.nan,2,7,10]
       }
df = pd.DataFrame(data=data)

In [10]:
#see top 5 rows
df.head()

     col1  col2  col3
0    john     1   1.0
1   sally     2   NaN
2  dorthy     5   2.0
3   cindy     7   7.0
4    mark     0  10.0

In [14]:
#sum rows for col2 and col3
dflist = ['col2','col3']
df['results'] = df[dflist].sum(axis=1, skipna=False)
df

     col1  col2  col3  results
0    john     1   1.0      2.0
1   sally     2   NaN      NaN
2  dorthy     5   2.0      7.0
3   cindy     7   7.0     14.0
4    mark     0  10.0     10.0